; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v7 ?v13)
             (pred_7 ?v6 ?v3)
             (pred_2 ?v7 ?v3)
             (pred_12 ?v8 ?v7 )
	     (pred_8 ?v7)
             (pred_1 ?v2)
             (pred_10 ?v6)
             (pred_5 ?v3)
             (pred_3 ?v7)
             (pred_6 ?v6)
             (pred_9 ?v7)
             (pred_11 ))



(:action op_2
:parameters (?v10 ?v9 ?v4 ?v1)
:precondition (and (pred_1 ?v10) (pred_1 ?v9) (pred_10 ?v4) (pred_5 ?v1)
          (pred_4 ?v10 ?v9) (pred_7 ?v4 ?v1)
                   (pred_2 ?v9 ?v1) (pred_8 ?v10) 
                   (pred_3 ?v9) (pred_6 ?v4))
:effect (and  (pred_9 ?v9) (not (pred_3 ?v9))))


(:action op_1
:parameters (?v10 ?v11)
:precondition (and (pred_1 ?v10) (pred_1 ?v11)
               (pred_8 ?v10) (pred_4 ?v10 ?v11) (pred_9 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v10))))

(:action op_3
:parameters (?v10 ?v4)
:precondition (and (pred_1 ?v10) (pred_10 ?v4) 
                  (pred_8 ?v10) (pred_12 ?v4 ?v10) (pred_11 ))
:effect (and (pred_6 ?v4)
   (not (pred_12 ?v4 ?v10)) (not (pred_11 ))))


(:action op_5
:parameters (?v10 ?v12 ?v5)
:precondition (and (pred_1 ?v10) (pred_10 ?v12) (pred_10 ?v5)
                  (pred_8 ?v10) (pred_6 ?v5) (pred_12 ?v12 ?v10))
:effect (and (pred_6 ?v12) (pred_12 ?v5 ?v10)
        (not (pred_6 ?v5)) (not (pred_12 ?v12 ?v10))))

(:action op_4
:parameters (?v10 ?v4)
:precondition (and (pred_1 ?v10) (pred_10 ?v4) 
                  (pred_8 ?v10) (pred_6 ?v4))
:effect (and (pred_11 ) (pred_12 ?v4 ?v10) (not (pred_6 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_07 obj_15 obj_18 obj_17 obj_02 obj_11 obj_13 obj_20 obj_12 obj_10 obj_14 obj_16 obj_05 obj_01 obj_08
    obj_04 obj_06
    obj_19 obj_09
    )

    (:init
       (pred_11)

       (pred_1 obj_03)
       (pred_1 obj_07)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_20)
       (pred_1 obj_12)
       (pred_1 obj_10)
       (pred_1 obj_14)
       (pred_1 obj_16)
       (pred_1 obj_05)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_5 obj_04)
       (pred_5 obj_06)
       (pred_10 obj_19)
       (pred_10 obj_09)

       (pred_4 obj_03 obj_17)
       (pred_4 obj_03 obj_07)
       (pred_4 obj_07 obj_02)
       (pred_4 obj_07 obj_15)
       (pred_4 obj_07 obj_03)
       (pred_4 obj_15 obj_11)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_15 obj_07)
       (pred_4 obj_18 obj_13)
       (pred_4 obj_18 obj_15)
       (pred_4 obj_17 obj_20)
       (pred_4 obj_17 obj_02)
       (pred_4 obj_17 obj_03)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_02 obj_11)
       (pred_4 obj_02 obj_07)
       (pred_4 obj_02 obj_17)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_11 obj_13)
       (pred_4 obj_11 obj_15)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_13 obj_14)
       (pred_4 obj_13 obj_18)
       (pred_4 obj_13 obj_11)
       (pred_4 obj_20 obj_16)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_17)
       (pred_4 obj_12 obj_05)
       (pred_4 obj_12 obj_10)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_10 obj_01)
       (pred_4 obj_10 obj_14)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_10 obj_12)
       (pred_4 obj_14 obj_08)
       (pred_4 obj_14 obj_13)
       (pred_4 obj_14 obj_10)
       (pred_4 obj_16 obj_05)
       (pred_4 obj_16 obj_20)
       (pred_4 obj_05 obj_01)
       (pred_4 obj_05 obj_12)
       (pred_4 obj_05 obj_16)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_10)
       (pred_4 obj_01 obj_05)
       (pred_4 obj_08 obj_14)
       (pred_4 obj_08 obj_01)
       (pred_3 obj_08)
       (pred_3 obj_14)
       (pred_2  obj_08 obj_04)
       (pred_2  obj_14 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_07)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_17)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_13)
       (pred_9 obj_20)
       (pred_9 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_16)
       (pred_9 obj_05)
       (pred_9 obj_01)

       (pred_7  obj_19 obj_04)
       (pred_7  obj_09 obj_06)
       (pred_12 obj_19 obj_15)
       (pred_12 obj_09 obj_16)
       (pred_8 obj_02)
    )

    (:goal (and
       (pred_12 obj_19 obj_18)
    ))
(:constraints
  (always (not (pred_8 obj_07)))
)
)

; plan
1. (op_1 obj_02 obj_11)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_11)
   goals met: 0 of 1
2. (op_1 obj_11 obj_15)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_15)
   goals met: 0 of 1
3. (op_3 obj_15 obj_19)
   deleted: (pred_12 obj_19 obj_15) (pred_11)
   added: (pred_6 obj_19)
   goals met: 0 of 1
4. (op_1 obj_15 obj_18)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_18)
   goals met: 0 of 1
5. (op_4 obj_18 obj_19)
   deleted: (pred_6 obj_19)
   added: (pred_11) (pred_12 obj_19 obj_18)
   goals met: 1 of 1
